load.yml
config:
  target: "http://localhost:3002/api/v0/vendor"
  http:
    timeout: 30000

  phases:
    - duration: 1
      arrivalCount: 1
      name: "Warm up"

scenarios:
  - flow:
      - post:
          url: "/validate/meter"
          json:
            meterNumber: "12345678910"
            venderType: "ELECTRICITY"
            disco: "IKEJA"
            partnerName: "ZENITH BANK"
            phoneNumber: "0801234517"
            email: "utoprids1@e.com"
            vendType: "PREPAID"
            amount: "1000"
          headers:
            x-api-key: "06145a157768d3da7a192cfe1ce362d77101cd501204457052cc6fa55ef99160206a7b1cd38dbdfa448f068ada371d5e7c7874932d1dcaeadf8457575e5f58a7"
            x-api-secret: "46bde9395200dfacaf234cf5b0565faeba98e7fa31349f723a0d3d4cead947565fca1f693e1976639e0caa5a5ceb9648"
          capture:
            - json: "$.data.transaction.id"
              as: "transactionId"
      # - think: 2

      - get:
          url: "/token/?transactionId={{ transactionId }}&amount=1500&bankComment=test%20comment&vendType=PREPAID&bankRefId=ASSBK0000{{ transactionId }}"
          headers:
            x-api-key: "06145a157768d3da7a192cfe1ce362d77101cd501204457052cc6fa55ef99160206a7b1cd38dbdfa448f068ada371d5e7c7874932d1dcaeadf8457575e5f58a7"
            x-api-secret: "46bde9395200dfacaf234cf5b0565faeba98e7fa31349f723a0d3d4cead947565fca1f693e1976639e0caa5a5ceb9648"